Description: Recalculates the package inventory on a Jamf Cloud Distribution Server.
Identifier: com.github.grahampugh.recipes.jamf.Blueprint-SoftwareUpdate
MinimumVersion: "2.3"

Input:
  REGION: eu

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfObjectReader
    Arguments:
      object_type: group
      object_name: All Managed

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfObjectUploader
    Arguments:
      JSS_URL: https://%REGION%.apigw.jamf.com
      GROUP_ID: "%object_id%"
      object_id: ""
      object_type: blueprint
      object_name: Update to Latest macOS
      object_template: blueprints-Update to Latest macOS.json
      replace_object: "true"
