Description: Adds a choice to a computer extension attribute and creates a Computer Smart Group
Comment: |
  Requires the following keys to be set or overridden:
  * EXTENSION_ATTRIBUTE_NAME
  * EXTENSION_ATTRIBUTE_VALUE
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Computer-EA-Choice-Add
MinimumVersion: "2.3"

Input:
  REPLACE: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfObjectReader
    Arguments:
      object_name: "%EXTENSION_ATTRIBUTE_NAME%"
      object_type: computer_extension_attribute

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributePopupChoiceAdjuster
    Arguments:
      choice_operation: add
      choice_value: "%EXTENSION_ATTRIBUTE_VALUE%"
      strict_mode: "False"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfObjectUploader
    Arguments:
      replace_object: "%REPLACE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      EXTENSION_ATTRIBUTE_OPERATOR: is
      EXTENSION_ATTRIBUTE_VALUE: "%EXTENSION_ATTRIBUTE_VALUE%"
      TARGET_GROUP_NAME: "%EXTENSION_ATTRIBUTE_NAME% - %EXTENSION_ATTRIBUTE_VALUE%"
      computergroup_name: "%TARGET_GROUP_NAME%"
      computergroup_template: ComputerGroup-EA.xml
      replace_group: "%REPLACE%"
