<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft Office 365 and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.jamf-upload.jamf.MicrosoftOffice365</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>EXCLUSION_GROUP_TEMPLATE</key>
		<string>SmartGroup-OSVersionLimits.xml</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroup-update-smart-MicrosoftOffice365.xml</string>
		<key>INSTALLED_REGEX_MATCH</key>
		<string>^(16\.1[7-9]\.|16\.[2-9]\d\.|17\.)</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>Microsoft Word.app</string>
		<key>NAME</key>
		<string>Microsoft Office 365</string>
		<key>OS_EXCLUDE_MAX</key>
		<string>10.13.6</string>
		<key>OS_EXCLUDE_MIN</key>
		<string>10.0.0</string>
		<key>OS_LIMITS_GROUP_NAME</key>
		<string>macOS %OS_EXCLUDE_MAX% or less</string>
		<key>PARAMETER4_TITLE</key>
		<string>--All or --O365 or --Volume</string>
		<key>PARAMETER4_VALUE</key>
		<string>--Volume</string>
		<key>PARAMETER5_TITLE</key>
		<string>--ForceClose</string>
		<key>PARAMETER5_VALUE</key>
		<string>--ForceClose</string>
		<key>PARAMETER6_TITLE</key>
		<string>--jamfUser</string>
		<key>PARAMETER6_VALUE</key>
		<string>--jamfUser</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-install-latest-MicrosoftOffice365.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>SCRIPT_NAME</key>
		<string>Microsoft Office License Removal Tool.sh</string>
		<key>SCRIPT_PRIORITY</key>
		<string>Before</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Microsoft Office 365 includes the following applications:
- Microsoft Word
- Microsoft Excel
- Microsoft PowerPoint
- Microsoft Outlook
- Microsoft OneNote
- Microsoft OneDrive
- Microsoft Teams
</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
		<key>curl</key>
		<string>True</string>
		<key>replace_group</key>
		<string>True</string>
		<key>replace_policy</key>
		<string>True</string>
		<key>replace_script</key>
		<string>True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.pkg.MicrosoftOffice365</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>script_category</key>
				<string>%CATEGORY%</string>
				<key>script_parameter4</key>
				<string>%PARAMETER4_TITLE%</string>
				<key>script_parameter5</key>
				<string>%PARAMETER5_TITLE%</string>
				<key>script_parameter6</key>
				<string>%PARAMETER6_TITLE%</string>
				<key>script_path</key>
				<string>%SCRIPT_NAME%</string>
				<key>script_priority</key>
				<string>%SCRIPT_PRIORITY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfScriptUploader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>group_name</key>
				<string>%GROUP_NAME%</string>
				<key>group_template</key>
				<string>%GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>group_name</key>
				<string>%OS_LIMITS_GROUP_NAME%</string>
				<key>group_template</key>
				<string>%EXCLUSION_GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
